; domain
(define (domain assembly_domain)
  (:requirements :strips :typing)
  (:types part location)

  (:predicates
    (at ?p - part ?l - location)
    (grasped ?p - part)
    (gripper_empty)
    (inserted ?p - part)
  )

  ;; 1) 去 pickup：现在是三参
  (:action goto_pickup
    :parameters (?p - part   ?from - location   ?to - location)
    :precondition (and
      (at ?p ?from)
      (gripper_empty)
    )
    :effect (and
      (not (at ?p ?from))
      (at ?p ?to)
    )
  )

  ;; 2) 抓
  (:action grasp
    :parameters (?p - part)
    :precondition (and
      (at ?p pickup_position_shaft1)
      (gripper_empty)
    )
    :effect (and
      (grasped ?p)
      (not (gripper_empty))
    )
  )

  ;; 3) 去 place：也三参
  (:action goto_place
    :parameters (?p - part   ?from - location   ?to - location)
    :precondition (and
      (at ?p ?from)
      (grasped ?p)
    )
    :effect (and
      (not (at ?p ?from))
      (at ?p ?to)
    )
  )

  ;; 4) 插
  (:action insertion
    :parameters (?p - part)
    :precondition (and
      (at ?p place_position_shaft1)
      (grasped ?p)
    )
    :effect (inserted ?p)
  )

  ;; 5) 放
  (:action release_gripper
    :parameters (?p - part)
    :precondition (inserted ?p)
    :effect (and
      (not (grasped ?p))
      (gripper_empty)
    )
  )
)

; problem
(define (problem shaft1_task)
  (:domain assembly_domain)

  (:objects
    shaft1 - part
    start
    pickup_position_shaft1
    place_position_shaft1 - location
  )

  (:init
    (at shaft1 start)
    (gripper_empty)
  )

  (:goal
    (and
      (inserted shaft1)
      (gripper_empty)
    )
  )
)

; plan
1. (goto_pickup shaft1 start pickup_position_shaft1)
   deleted: (at shaft1 start)
   added: (at shaft1 pickup_position_shaft1)
   goals met: 1 of 2
2. (grasp shaft1)
   deleted: (gripper_empty)
   added: (grasped shaft1)
   goals met: 0 of 2
3. (goto_place shaft1 pickup_position_shaft1 place_position_shaft1)
   deleted: (at shaft1 pickup_position_shaft1)
   added: (at shaft1 place_position_shaft1)
   goals met: 0 of 2
4. (insertion shaft1)
   added: (inserted shaft1)
   goals met: 1 of 2
5. (release_gripper shaft1)
   deleted: (grasped shaft1)
   added: (gripper_empty)
   goals met: 2 of 2
